# language: ja

機能: ブログの記事を投稿する

  管理者は、ブログの作成画面にて
  入力したタイトルおよび内容を投稿することができる。
 
  シナリオ: ブログの新規作成
    前提 管理画面のブログの作成画面を表示している
    もし ブログの投稿日時の値を選択する
    かつ ブログのテキストフィールド "タイトル" に値を入力する
    かつ ブログのテキストエリア "内容1" に値を入力する
    かつ ブログのテキストエリア "内容2" に値を入力する
    かつ "投稿する" ボタンをクリックする
    ならば "ブログが作成されました。" メッセージが表示される
    かつ 管理画面のブログ一覧にブログが 1 件表示される

  シナリオ: タイトルが空のブログを新規作成
    前提 管理画面のブログの作成画面を表示している
    もし ブログの投稿日時の値を選択する
    かつ ブログのテキストフィールド "タイトル" に値を入力しない
    かつ ブログのテキストエリア "内容1" に値を入力する
    かつ ブログのテキストエリア "内容2" に値を入力する
    かつ "投稿する" ボタンをクリックする
    ならば エラーメッセージが表示される

  シナリオ: 内容1が空のブログを新規作成
    前提 管理画面のブログの作成画面を表示している
    もし ブログの投稿日時の値を選択する
    かつ ブログのテキストフィールド "タイトル" に値を入力する
    かつ ブログのテキストエリア "内容1" に値を入力しない
    かつ ブログのテキストエリア "内容2" に値を入力する
    かつ "投稿する" ボタンをクリックする
    ならば エラーメッセージが表示される
