# language: ja

機能: ナビゲーションバーとサイドメニューを表示する

  ユーザーは、サイトのナビゲーションバーのメニューとサイドメニューを表示することができる。

  シナリオ: ログインしていないユーザーがHOME画面を表示する
    前提 "HOME" 画面を表示している
    もし ユーザーがログインしていない
    ならば メニュー "HOME" が表示される
    かつ メニュー "BLOG" が表示される
    かつ メニュー "管理" が表示されない
    #かつ サイドメニュー "プロフィール" が表示される
    #かつ サイドメニュー "メニュー" が表示される

  シナリオ: ログインしている一般ユーザーがHOME画面を表示する
    前提 "HOME" 画面を表示している
    #もし 一般ユーザーがログインしている
    ならば メニュー "HOME" が表示される
    #かつ メニュー "BLOG" が表示される
    #かつ メニュー "管理" が表示されない

  シナリオ: 管理ユーザーがHOME画面を表示する
    前提 "HOME" 画面を表示している
    #もし 管理ユーザーがログインしている
    #ならば メニュー "HOME" が表示される
    #かつ メニュー "BLOG" が表示される
    #かつ メニュー "管理" が表示される
