# language: ja

機能: HOMEのサイドメニューを表示する

  訪問ユーザーは、
  HOMEにてサイドメニュー（プロフィール、メニュー）を表示する。

  シナリオアウトライン: サイドメニューを表示する

    もし "<page>"ページを表示する
    ならば サイドメニュー"<menu>"が表示される

    例:
      | page       | menu           |
      | トップ     | プロフィール   |
      | トップ     | メニュー       |

  シナリオ: プロフィールを表示する
    もし "トップ"ページを表示する
    ならば プロフィールに"架慧（かえ）"が表示される
    かつ プロフィールに"@kae_kasui"が表示される

  シナリオアウトライン: メニューを表示する
    もし "トップ"ページを表示する
    ならば メニュー"<menu>"が表示される

    例:
      | menu |
      | HOME  |
      | BLOG |
