# language: ja

機能: BLOGのサイドメニューを表示する

  訪問ユーザーは、
  HOMEにてサイドメニュー（プロフィール、メニュー）を表示する。

  シナリオアウトライン: サイドメニューを表示する

    もし "<page>"ページを表示する
    ならば サイドメニュー"<menu>"が表示される

    例:
      | page       | menu           |
      | ブログ一覧 | プロフィール   |
      | ブログ一覧 | 最近の記事     |
      | ブログ一覧 | 最近のコメント |
      | ブログ一覧 | リンク         |

  シナリオ: プロフィールを表示する
    もし "ブログ一覧"ページを表示する
    ならば プロフィールに"架慧（かえ）"が表示される
    かつ プロフィールに"@kae_kasui"が表示される

  シナリオアウトライン: 最近の記事を表示する
    前提 ブログの記事が"<items>"件である場合
    もし "ブログ一覧"ページを表示する
    ならば 最近の記事が"<blogs>"件表示される

    例:
      | items | blogs |
      | 1     | 1     |
      | 2     | 2     |
      | 3     | 3     |
      | 4     | 4     |
      | 5     | 5     |
      | 6     | 5     |
      | 10    | 5     |

  シナリオアウトライン: 最近のコメントを表示する
    前提 ブログの記事が"1"件である場合
    かつ ブログのコメントが"<items>"件である場合
    もし "ブログ一覧"ページを表示する
    ならば 最近のコメントが"<blogs>"件表示される

    例:
      | items | blogs |
      | 1     | 1     |
      | 2     | 2     |
      | 3     | 3     |
      | 4     | 4     |
      | 5     | 5     |
      | 6     | 5     |
      | 10    | 5     |

  シナリオアウトライン: リンクを表示する
    前提 ブログのリンクが"<items>"件である場合
    もし "ブログ一覧"ページを表示する
    ならば リンクが"<links>"件表示される

    例:
      | items | links |
      | 1     | 1     |
      | 2     | 2     |
      | 4     | 4     |
      | 8     | 8     |
      | 16    | 16    |

  シナリオ: メールフォームを表示する
    もし "ブログ一覧"ページを表示する
    ならば サイドメニュー"メールフォーム"が表示される
    かつ テキストエリアが表示される
    かつ ボタン"送信する"が表示される
